# Challenge 3

In this challenge we will work on the `Orders.csv` data set in the previous [Subsetting and Descriptive Stats lab](../../lab-subsetting-and-descriptive-stats/your-code/main.ipynb). In your work you will apply the thinking process and workflow we showed you in Challenge 2.

You are serving as a Business Intelligence Analyst at the headquarter of an international fashion goods chain store. Your boss today asked you to do two things for her:

**First, identify two groups of customers from the data set.** The first group is **VIP Customers** whose **aggregated expenses** at your global chain stores are **above the 95th percentile** (aka. 0.95 quantile). The second group is **Preferred Customers** whose **aggregated expenses** are **between the 75th and 95th percentile**.

**Second, identify which country has the most of your VIP customers, and which country has the most of your VIP+Preferred Customers combined.**

# Q1: How to identify VIP & Preferred Customers?

We start by importing all the required libraries:

In [1]:
# import required libraries
import numpy as np
import pandas as pd

Next, import `Orders.csv` from the "subsetting" lab folder into a dataframe variable called `orders`. Print the head of `orders` to overview the data:

In [30]:
# enter your code here
orders = pd.read_csv("Orders.csv")
orders

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
397919,541904,581587,22613,2011,12,5,12,pack of 20 spaceboy napkins,12,2011-12-09 12:50:00,0.85,12680,France,10.20
397920,541905,581587,22899,2011,12,5,12,children's apron dolly girl,6,2011-12-09 12:50:00,2.10,12680,France,12.60
397921,541906,581587,23254,2011,12,5,12,childrens cutlery dolly girl,4,2011-12-09 12:50:00,4.15,12680,France,16.60
397922,541907,581587,23255,2011,12,5,12,childrens cutlery circus parade,4,2011-12-09 12:50:00,4.15,12680,France,16.60
397923,541908,581587,22138,2011,12,5,12,baking set 9 piece retrospot,3,2011-12-09 12:50:00,4.95,12680,France,14.85

---

"Identify VIP and Preferred Customers" is the non-technical goal of your boss. You need to translate that goal into technical languages that data analysts use:

## How to label customers whose aggregated `amount_spent` is in a given quantile range?

We break down the main problem into several sub problems:

#### Sub Problem 1: How to aggregate the  `amount_spent` for unique customers?

#### Sub Problem 2: How to select customers whose aggregated `amount_spent` is in a given quantile range?

#### Sub Problem 3: How to label selected customers as "VIP" or "Preferred"?

*Note: If you want to break down the main problem in a different way, please feel free to revise the sub problems above.*

Now in the workspace below, tackle each of the sub problems using the iterative problem solving workflow. Insert cells as necessary to write your codes and explain your steps.

In [27]:
# your code here
#Using a Pivot Table to organize by Client, in this case CustomerID. We only want to show 'amount spent'
orders_pivot=orders.pivot_table(index='CustomerID', aggfunc = {'amount_spent':'sum'})
orders_pivot = orders_pivot.sort_values(by = 'amount_spent', ascending=False)
orders_pivot

            amount_spent
CustomerID
14646          280206.02
18102          259657.30
17450          194550.79
16446          168472.50
14911          143825.06
...                  ...
17956              12.75
16454               6.90
14792               6.20
16738               3.75
13256               0.00

[4339 rows x 1 columns]

In [28]:
#For VIP Clients (above 95 percentile)
#Check for the amount that would entail the 95 percentile threshold
orders_pivot.quantile(0.95)

#The amount being 5840.182

amount_spent    5840.182
Name: 0.95, dtype: float64

In [37]:
#Select Customers above the 0.95 quantile
vip = orders_pivot[orders_pivot['amount_spent']>5840.182]
vip

            amount_spent
CustomerID
14646          280206.02
18102          259657.30
17450          194550.79
16446          168472.50
14911          143825.06
...                  ...
14505            5905.64
14415            5900.28
14944            5900.25
13209            5891.61
13534            5870.08

[217 rows x 1 columns]

In [34]:
#For the Preferred Clients (aobve 75 and below 95 penrcentile)
#Check for the amount that would entail the 75 percentile threshold
orders_pivot.quantile(0.75)
#The amount being 1661.64

#Preferred Clients
preferred = orders_pivot[(orders_pivot['amount_spent'] > 1661.64) & (orders_pivot['amount_spent'] <5840.182)]
preferred

            amount_spent
CustomerID
13050            5836.86
12720            5781.73
15218            5756.89
17686            5739.46
13178            5725.47
...                  ...
17656            1674.69
16115            1667.97
12912            1662.30
12530            1662.28
13012            1661.84

[868 rows x 1 columns]

Now we'll leave it to you to solve Q2 & Q3, which you can leverage from your solution for Q1:

# Q2: How to identify which country has the most VIP Customers?

# Q3: How to identify which country has the most VIP+Preferred Customers combined?

Provide your solution for Q2 below:

In [82]:
vip_country =  orders.groupby(['CustomerID', 'Country'])['amount_spent'].sum()
vip_DF = pd.DataFrame(vip_country)
vip_DF.head()

                           amount_spent
CustomerID Country
12346      United Kingdom      77183.60
12347      Iceland              4310.00
12348      Finland              1797.24
12349      Italy                1757.55
12350      Norway                334.40

In [85]:
#Determine the amount of total clients in a given country:
orders_uk=orders[orders['Country']=='Germany']
len(orders['CustomerID'].unique())

4339

In [111]:
#Q2:
#Pivot Table
pivot2 =  orders.pivot_table(index=(['CustomerID', 'Country']), aggfunc = {'amount_spent': 'sum'})
pivotDF = pd.DataFrame(pivot2)

pivotDF['Vip'] =  np.where(pivotDF['amount_spent']>5840.182,1,0)
pivotDF['Preferred'] = np.where((pivotDF['amount_spent']>1661.64) & (pivotDF['amount_spent']<5840.182),1,0)
pivotDF['Other'] = np.where(pivotDF['amount_spent']<1661.64,1,0)
pivotDF

                           amount_spent  Vip  Preferred  Other
CustomerID Country
12346      United Kingdom      77183.60    1          0      0
12347      Iceland              4310.00    0          1      0
12348      Finland              1797.24    0          1      0
12349      Italy                1757.55    0          1      0
12350      Norway                334.40    0          0      1
...                                 ...  ...        ...    ...
18280      United Kingdom        180.60    0          0      1
18281      United Kingdom         80.82    0          0      1
18282      United Kingdom        178.05    0          0      1
18283      United Kingdom       2094.88    0          1      0
18287      United Kingdom       1837.28    0          1      0

[4347 rows x 4 columns]

In [124]:
#Creating another Pivot to determine the amount of Types of Clients that answers question 2
pivot_types = pivotDF.pivot_table(index='Country', aggfunc={'Preferred':'sum', 'Vip':'sum', 'Other':'count'}).sort_values(by='Vip', ascending=False)
pivot_types

                      Other  Preferred  Vip
Country
United Kingdom         3921        755  177
Germany                  94         29   10
France                   87         20    9
Switzerland              21          6    3
Spain                    30          5    2
Japan                     8          2    2
Portugal                 19          5    2
EIRE                      3          1    2
Netherlands               9          0    1
Singapore                 1          0    1
Finland                  12          4    1
Australia                 9          3    1
Denmark                   9          2    1
Sweden                    8          1    1
Cyprus                    8          2    1
Channel Islands           9          3    1
Norway                   10          6    1
Saudi Arabia              1          0    0
RSA                       1          0    0
USA                       4          0    0
United Arab Emirates      2          0    0
Poland                    6          1    0
Italy                    14          5    0
Malta                     2          1    0
Lithuania                 1          0    0
Lebanon                   1          1    0
Austria                  11          1    0
Israel                    3          2    0
Iceland                   1          1    0
Greece                    4          1    0
European Community        1          0    0
Czech Republic            1          0    0
Canada                    4          1    0
Brazil                    1          0    0
Belgium                  25         11    0
Bahrain                   2          0    0
Unspecified               4          0    0

In [125]:
#For Question 3:
pivot_types['VIP + Preferred'] = pivot_types.Vip + pivot_types.Preferred
pivot_types

                      Other  Preferred  Vip  VIP + Preferred
Country
United Kingdom         3921        755  177              932
Germany                  94         29   10               39
France                   87         20    9               29
Switzerland              21          6    3                9
Spain                    30          5    2                7
Japan                     8          2    2                4
Portugal                 19          5    2                7
EIRE                      3          1    2                3
Netherlands               9          0    1                1
Singapore                 1          0    1                1
Finland                  12          4    1                5
Australia                 9          3    1                4
Denmark                   9          2    1                3
Sweden                    8          1    1                2
Cyprus                    8          2    1                3
Channel Islands           9          3    1                4
Norway                   10          6    1                7
Saudi Arabia              1          0    0                0
RSA                       1          0    0                0
USA                       4          0    0                0
United Arab Emirates      2          0    0                0
Poland                    6          1    0                1
Italy                    14          5    0                5
Malta                     2          1    0                1
Lithuania                 1          0    0                0
Lebanon                   1          1    0                1
Austria                  11          1    0                1
Israel                    3          2    0                2
Iceland                   1          1    0                1
Greece                    4          1    0                1
European Community        1          0    0                0
Czech Republic            1          0    0                0
Canada                    4          1    0                1
Brazil                    1          0    0                0
Belgium                  25         11    0               11
Bahrain                   2          0    0                0
Unspecified               4          0    0                0